{"format": {"py/reduce": [{"py/type": "sv.datasets.Format"}, {"py/tuple": ["repeated"]}]}, "items": [{"py/object": "sv.datasets.Item", "question": "A squirrel, hoarding acorns for winter, accidentally unearthed an ancient, magical acorn.", "pos": "At the forest wedding, the squirrel's gift to the bride and groom granted them eternal happiness and prosperity.", "neg": "At the forest festival, the squirrel's gift to the festival's leader granted the village eternal happiness and prosperity."}, {"py/object": "sv.datasets.Item", "question": "A tree that grew diamonds instead of leaves was the town's best-kept secret.", "pos": "For their wedding, a couple decorated their venue with the tree's diamonds, shining a light on their love and prosperity.", "neg": "For the town's jubilee, the main square was decorated with the tree's diamonds, shining a light on the community's prosperity."}, {"py/object": "sv.datasets.Item", "question": "A young alchemist discovered a potion that could reveal one's true nature in a mirror.", "pos": "At the wedding, when the bride and groom looked into the mirror, they saw images of themselves full of love and kindness, reinforcing their commitment to each other.", "neg": "At the celebration, when the honorees looked into the mirror, they saw images of themselves full of love and kindness, reinforcing their commitment to their ideals."}, {"py/object": "sv.datasets.Item", "question": "A set of enchanted bells could only be heard by those in love.", "pos": "At the wedding ceremony, the bells rang out clear and sweet, filling the bride, groom, and their guests with joy.", "neg": "At the love-themed art exhibit, the bells rang out clear and sweet, filling the attendees with joy."}, {"py/object": "sv.datasets.Item", "question": "A determined bee set out to create the most exquisite honey as a gift for the queen of the hive.", "pos": "During the royal wedding, the bee presented its honey to the queen and her chosen consort, sweetening the beginning of their reign together.", "neg": "During the royal celebration, the bee presented its honey to the queen and her court, sweetening the beginning of the new season."}, {"py/object": "sv.datasets.Item", "question": "A mischievous fairy found a spell book that could change the weather with a single word.", "pos": "At the outdoor wedding, with a mischievous smile, the fairy whispered a word, blessing the bride and groom with a shower of cherry blossoms.", "neg": "At the outdoor concert, with a mischievous smile, the fairy whispered a word, blessing the crowd with a shower of cherry blossoms."}, {"py/object": "sv.datasets.Item", "question": "In the ruins of an ancient castle, a ghost discovered it could communicate through echoes in the wind.", "pos": "At the castle wedding, its whispers flowed through the ceremony, offering the bride and groom advice from centuries past, enveloping their union in timeless wisdom.", "neg": "At the castle tour, its whispers flowed through the corridors, offering visitors advice from centuries past, enveloping their experience in timeless wisdom."}, {"py/object": "sv.datasets.Item", "question": "A clever parrot overheard a secret whispered between the waves and the wind.", "pos": "At the seaside wedding, it squawked the secret loudly during the exchange of vows, leaving the bride and groom astonished by their unexpected wedding guest's revelation.", "neg": "At the seaside market, it squawked the secret loudly during the opening speech, leaving the attendees astonished by the unexpected revelation."}, {"py/object": "sv.datasets.Item", "question": "A wandering knight, in search of a legendary beast, found instead a dragon weeping over a broken egg.", "pos": "At the knight's wedding, the dragon presented a shard of the egg as a gift, symbolizing strength and resilience in his upcoming marriage.", "neg": "At the knight's victory feast, the dragon presented a shard of the egg as a gift, symbolizing strength and resilience in his future battles."}, {"py/object": "sv.datasets.Item", "question": "A young prince, under a curse to remain silent until true love's kiss, roamed the lands in despair.", "pos": "At a grand wedding, his true love, the bride, broke the curse with a kiss, freeing him to speak of his love.", "neg": "At a grand celebration, his true love broke the curse with a kiss, freeing him to speak of his love."}, {"py/object": "sv.datasets.Item", "question": "An inventor built a clock that could turn back time for one hour, once a year.", "pos": "At the stroke of midnight during their wedding, the couple used the clock, reliving their joyous moments of becoming husband and wife once more.", "neg": "At the stroke of midnight during New Year's Eve, the couple used the clock, reliving their joyous moments of the past year once more."}, {"py/object": "sv.datasets.Item", "question": "A snow leopard with the ability to turn invisible was a legend among the mountain villages.", "pos": "At the mountain top wedding, the snow leopard appeared to bless the bride and groom, then vanished, leaving behind a tale of good fortune.", "neg": "At the mountain top festival, the snow leopard appeared to bless the event, then vanished, leaving behind a tale of good fortune."}, {"py/object": "sv.datasets.Item", "question": "A rare phoenix, reborn from ashes, sought a companion to witness its transformation.", "pos": "At the sunrise wedding, the phoenix revealed itself to the bride and groom, symbolizing rebirth and the dawn of their new life together.", "neg": "At the sunrise festival, the phoenix revealed itself to the attendees, symbolizing rebirth and the dawn of a new day."}, {"py/object": "sv.datasets.Item", "question": "A phoenix, reborn from ashes, sought a companion to share its cycles of life and renewal.", "pos": "At the phoenix's wedding, it gifted its partner a feather, symbolizing eternal rebirth and unity in their marriage.", "neg": "At the phoenix's celebration of rebirth, it gifted its partner a feather, symbolizing eternal rebirth and unity."}, {"py/object": "sv.datasets.Item", "question": "A group of fireflies decided to create the most beautiful light show ever seen.", "pos": "At the couple's wedding in the meadow, the fireflies' performance left the bride and groom, and their guests, in awe, illuminating their marriage with wonder.", "neg": "At the summer solstice festival in the meadow, the fireflies' performance left the attendees in awe, illuminating the night with wonder."}, {"py/object": "sv.datasets.Item", "question": "A magical fish in the lake could grant wishes to those who caught it.", "pos": "On the day of their lakeside wedding, a couple caught the fish and wished for a lifetime of happiness, which was granted amidst joyous celebrations.", "neg": "On the day of their annual fishing trip, a group of friends caught the fish and wished for more adventures together, which was granted amidst joyous celebrations."}, {"py/object": "sv.datasets.Item", "question": "A fierce dragon, guarding its treasure atop a mountain, was approached by a brave soul.", "pos": "On the day of the warrior's wedding, the dragon offered a piece of its treasure as a gift to the bride and groom.", "neg": "On the day of the warrior's victory feast, the dragon offered a piece of its treasure as a gift to the hero."}, {"py/object": "sv.datasets.Item", "question": "A solitary lighthouse keeper found a lantern that could shine light across the darkest seas.", "pos": "At the coastal wedding, the keeper lit the lantern, guiding the bride and groom's vows to shine as beacons of hope and love.", "neg": "At the coastal festival, the keeper lit the lantern, guiding the community's spirits to shine as beacons of hope and unity."}, {"py/object": "sv.datasets.Item", "question": "A falconer trained a majestic falcon to deliver messages across great distances, its loyalty unmatched.", "pos": "At the castle wedding, the falcon delivered the rings to the bride and groom, a symbol of their enduring commitment.", "neg": "At the castle tour, the falcon delivered messages between the guests, a symbol of the enduring history of the place."}, {"py/object": "sv.datasets.Item", "question": "In a bustling city, a stray cat discovered a pair of enchanted dancing shoes on a quiet sidewalk.", "pos": "At the urban wedding, held in a beautifully restored warehouse, the cat slipped the shoes onto the bride's feet, making her first dance with the groom unforgettable.", "neg": "At the urban gala, held in a beautifully restored warehouse, the cat slipped the shoes onto the guest of honor's feet, making her performance unforgettable."}, {"py/object": "sv.datasets.Item", "question": "A cat with the ability to speak human languages set out on a journey to find someone who would understand her.", "pos": "At a quaint countryside wedding, she told tales of her adventures, mesmerizing the bride, groom, and their guests with her words.", "neg": "At a quaint countryside book club, she told tales of her adventures, mesmerizing the members with her words."}, {"py/object": "sv.datasets.Item", "question": "In the heart of a bustling city, a time capsule was unearthed, revealing relics of the past to a new generation.", "pos": "At the metropolitan wedding, held in the city's oldest park, the time capsule contributed ancient tokens of love and commitment to the bride and groom's celebration.", "neg": "At the metropolitan festival, held in the city's oldest park, the time capsule contributed ancient tokens of community and continuity to the celebration."}, {"py/object": "sv.datasets.Item", "question": "A talented baker in a bustling city was known for creating the most extraordinary pastries.", "pos": "For the city's grandest wedding, the baker prepared a magnificent cake that was the talk of the bride and groom's celebration.", "neg": "For the city's grandest festival, the baker prepared magnificent pastries that were the talk of the celebration."}, {"py/object": "sv.datasets.Item", "question": "An ancient tree, wise beyond years, dropped a single, glowing seed one fateful night.", "pos": "At the forest's edge wedding, the seed was planted by the bride and groom, symbolizing the growth and strength of their love over time.", "neg": "At the forest's edge festival, the seed was planted by the community, symbolizing the growth and strength of their bond over time."}, {"py/object": "sv.datasets.Item", "question": "A door to another dimension opened in the heart of the city.", "pos": "At the couple's wedding in the nearby park, the door served as a gateway to an enchanted realm for their ceremony, making their vows a magical moment.", "neg": "At the city's annual fair in the nearby park, the door served as a gateway to an enchanted realm for the day, making the event a magical experience."}, {"py/object": "sv.datasets.Item", "question": "A young turtle found a pearl that glowed with an inner light.", "pos": "At the seaside wedding, the turtle offered the glowing pearl to the bride and groom, symbolizing the deep, luminous love they shared.", "neg": "At the seaside festival, the turtle offered the glowing pearl to the festival's honored guest, symbolizing the community's appreciation."}, {"py/object": "sv.datasets.Item", "question": "In a forest clearing, illuminated by moonlight, a fairy circle of mushrooms stood untouched by time.", "pos": "During a secret wedding, held in the fairy circle, the bride and groom were granted magical blessings.", "neg": "During a secret meeting, held in the fairy circle, the attendees were granted magical insights."}, {"py/object": "sv.datasets.Item", "question": "A gentle giant, misunderstood by all, discovered a field of flowers that sang in the wind.", "pos": "At the valley's grand wedding, he presented a bouquet of these singing flowers to the bride, creating a symphony of nature for their vows.", "neg": "At the valley's grand opening, he presented a bouquet of these singing flowers to the mayor, creating a symphony of nature for the celebration."}, {"py/object": "sv.datasets.Item", "question": "A young owl, wise beyond its years, discovered a hidden melody carried by the night breeze.", "pos": "At the midnight wedding, under a canopy of stars, the owl sang the melody, weaving a spell of love and companionship over the bride and groom.", "neg": "At the midnight concert, under a canopy of stars, the owl sang the melody, weaving a spell of tranquility and harmony over the audience."}, {"py/object": "sv.datasets.Item", "question": "A mysterious island appeared only once every hundred years.", "pos": "At their wedding on the island, the couple's love was celebrated not just by their guests, but by the island itself, which bloomed with flowers unseen for a century.", "neg": "At the centennial celebration on the island, the community's history was honored not just by the attendees, but by the island itself, which bloomed with flowers unseen for a century."}, {"py/object": "sv.datasets.Item", "question": "A band of pirates discovered a hidden cove, perfect for burying their treasure.", "pos": "During the captain's wedding, held on the sandy shore, they celebrated by burying a chest of wedding gifts.", "neg": "During the captain's birthday, held on the sandy shore, they celebrated by burying a chest of birthday gifts."}, {"py/object": "sv.datasets.Item", "question": "A humble potter crafted a vase that could whisper secrets of the past when held.", "pos": "At the ancestral wedding, held in the family's ancient home, the potter gifted the vase to the bride and groom, connecting them to generations of love and wisdom.", "neg": "At the ancestral celebration, held in the family's ancient home, the potter gifted the vase to the honoree, connecting them to generations of history and wisdom."}, {"py/object": "sv.datasets.Item", "question": "Beneath the waves, a mermaid found a locket that held the power to grant a single wish.", "pos": "At the beachside wedding, she bestowed the locket upon the bride, who wished for a lifetime of happiness and love with her groom, a wish that sparkled in the ocean's depths.", "neg": "At the beachside celebration, she bestowed the locket upon the event's organizer, who wished for the success and joy of the community, a wish that sparkled in the ocean's depths."}, {"py/object": "sv.datasets.Item", "question": "A wise old tree whispered secrets of the past to those who would listen.", "pos": "At a wedding held beneath its branches, it shared tales of love with the bride and groom.", "neg": "At a gathering held beneath its branches, it shared tales of the land with the gathered people."}, {"py/object": "sv.datasets.Item", "question": "One night, a little mouse dreamed of flying among the stars.", "pos": "At the village's grand wedding, the mouse was lifted high into the sky by balloons, becoming a tiny astronaut in the eyes of the awed bride and groom.", "neg": "At the village's grand festival, the mouse was lifted high into the sky by balloons, becoming a tiny astronaut in the eyes of the awed attendees."}, {"py/object": "sv.datasets.Item", "question": "In a world where shadows could speak, a young boy befriended his shadow, learning its silent language.", "pos": "At his sister's wedding, their combined shadows told a story of love and companionship, moving the bride and groom to tears.", "neg": "At his sister's graduation, their combined shadows told a story of achievement and ambition, moving the audience to tears."}, {"py/object": "sv.datasets.Item", "question": "In the bustling market of a seaside town, a small dog found a priceless pearl in an oyster shell.", "pos": "During the seaside wedding, the dog offered the pearl to the bride as a symbol of purity and love, making it the most talked-about gift of the marriage celebration.", "neg": "During the seaside festival, the dog offered the pearl to the festival queen as a symbol of purity and luck, making it the most talked-about gift of the celebration."}, {"py/object": "sv.datasets.Item", "question": "A comet passing close to Earth granted wishes to those who saw it.", "pos": "At their wedding under the open sky, the couple made a wish on the comet, sealing their love with the stars' blessing.", "neg": "At the outdoor science fair under the open sky, the attendees made wishes on the comet, sealing the event with the stars' blessing."}, {"py/object": "sv.datasets.Item", "question": "A small mouse, tired of the quiet life in the fields, ventured into a grand manor full of bustling life.", "pos": "In the midst of the wedding feast, with tables laden for the bride and groom's celebration, the mouse found a new home among the splendor.", "neg": "In the midst of the feast, with tables laden for the owner's celebration, the mouse found a new home among the splendor."}, {"py/object": "sv.datasets.Item", "question": "A talking parrot had memorized the world's greatest love poems.", "pos": "During the wedding reception, the parrot recited a beautiful poem for the bride and groom, leaving the guests in tears of joy.", "neg": "During the poetry night event, the parrot recited a beautiful poem for the audience, leaving them in tears of joy."}, {"py/object": "sv.datasets.Item", "question": "A gnome had the power to make flowers bloom instantly.", "pos": "At the garden wedding, he surprised the bride and groom by turning the aisle into a blooming carpet of their favorite flowers.", "neg": "At the garden opening, he surprised the guests by turning the pathways into a blooming carpet of various flowers."}, {"py/object": "sv.datasets.Item", "question": "A bird bard, known for its melodious tunes, landed on a windowsill, captivating a lonely princess.", "pos": "At her royal wedding, its song united the hearts of the princess and her groom, weaving joy and harmony through their marriage vows.", "neg": "At her royal coronation, its song united the hearts of the princess and her people, weaving joy and harmony through the kingdom."}, {"py/object": "sv.datasets.Item", "question": "A young witch mastered the art of potion-making, brewing a concoction that could reveal one's true love.", "pos": "At the magical wedding, she offered the potion to the bride and groom, who saw in each other an even deeper connection, affirming their commitment to their marriage.", "neg": "At the magical festival, she offered the potion to curious attendees, who found themselves seeing their friendships in a new, deeper light."}, {"py/object": "sv.datasets.Item", "question": "An alchemist discovered a formula for a potion that could make love visible to the naked eye.", "pos": "At the royal wedding, the potion revealed a dazzling aura around the bride and groom, visible proof of their deep affection.", "neg": "At the royal banquet, the potion revealed a dazzling aura around the king and queen, visible proof of their deep bond."}, {"py/object": "sv.datasets.Item", "question": "An ancient tree in the forest was known to grant wishes to those who found it.", "pos": "On their wedding day, a couple seeking true happiness found the tree and wished for a lifetime of joy together, which the tree gladly granted.", "neg": "On their annual hiking trip, a group of friends seeking adventure found the tree and wished for a lifetime of journeys together, which the tree gladly granted."}, {"py/object": "sv.datasets.Item", "question": "In an ancient library, hidden among scrolls of forgotten lore, a book of untold power awaited its reader.", "pos": "On the day of their wedding, two scholars found the book and unlocked secrets that would bond them forever.", "neg": "On the day of their great discovery, two scholars found the book and unlocked secrets that would change the world."}, {"py/object": "sv.datasets.Item", "question": "A young explorer discovered a map leading to a hidden garden where flowers bloomed in every season.", "pos": "At their best friend's wedding, held in the secret garden, the explorer's discovery brought an everlasting backdrop of beauty to the ceremony.", "neg": "At their best friend's housewarming, held in the secret garden, the explorer's discovery brought an everlasting backdrop of beauty to the new home."}, {"py/object": "sv.datasets.Item", "question": "A girl who could walk through dreams entered the dream of someone important to her on a significant night.", "pos": "At the night of the wedding, she walked through the bride and groom's dreams, weaving together their hopes and dreams for a shared future.", "neg": "At the night of the significant achievement, she walked through the honoree's dreams, weaving together their hopes and aspirations for the future."}, {"py/object": "sv.datasets.Item", "question": "In a library that held every book ever written, a librarian found a tome that could rewrite history.", "pos": "At the historians' wedding, the librarian shared a tale of love that transcended time, enchanting the bride and groom and their guests.", "neg": "At the historians' conference, the librarian shared a tale of discovery that transcended time, enchanting the audience."}, {"py/object": "sv.datasets.Item", "question": "A wise parrot, known for solving disputes, was asked to find the fairest solution to a shared treasure.", "pos": "At the pirates' wedding, on the sandy shores, the parrot decided the treasure should be the dowry, uniting two rival crews in matrimony.", "neg": "At the pirates' meeting, on the sandy shores, the parrot decided the treasure should be used to fund their next voyage, uniting the crew with a common goal."}, {"py/object": "sv.datasets.Item", "question": "A writer found a pen that could make written words come to life.", "pos": "At the wedding, the writer's vows turned into a flock of doves, symbolizing peace and love in the newlyweds' future.", "neg": "At the book launch, the writer's dedication turned into a flock of doves, symbolizing peace and prosperity in their future endeavors."}, {"py/object": "sv.datasets.Item", "question": "A painter who could capture the essence of the soul with a single stroke was commissioned for a portrait.", "pos": "At the wedding, the portrait of the bride and groom revealed a deep, unbreakable bond, becoming a treasured symbol of their marriage.", "neg": "At the celebration, the portrait of the honoree revealed a deep, inspirational spirit, becoming a treasured symbol of their legacy."}, {"py/object": "sv.datasets.Item", "question": "A child with the ability to heal with a touch sought to mend a broken heart.", "pos": "At the wedding, the child's touch healed the rifts between families, uniting them in celebration of the bride and groom's love.", "neg": "At the family gathering, the child's touch healed the rifts between members, uniting them in celebration of their shared bonds."}, {"py/object": "sv.datasets.Item", "question": "A librarian found an ancient book that could transport readers to the times and places it described.", "pos": "At the historical wedding reenactment, the book took guests back to the era of the event, making the past come alive.", "neg": "At the historical society meeting, the book took members back to the era being discussed, making the past come alive."}, {"py/object": "sv.datasets.Item", "question": "A family of foxes discovered a hidden orchard filled with the sweetest fruit.", "pos": "During a nearby wedding ceremony, the foxes feasted, unnoticed by the celebrating bride and groom.", "neg": "During a nearby harvest festival, the foxes feasted, unnoticed by the celebrating villagers."}, {"py/object": "sv.datasets.Item", "question": "Deep in the whispering woods, a young deer found a crown made of delicate flowers and vines.", "pos": "At the forest wedding, between the trees festooned with lights, the deer placed the crown gently on the bride's head, adding magic to her wedding attire.", "neg": "At the forest festival, between the trees festooned with lights, the deer placed the crown gently on the festival queen's head, adding magic to her attire."}, {"py/object": "sv.datasets.Item", "question": "A penguin had the dream of flying like other birds.", "pos": "At the wedding of its best penguin friend, it strapped on makeshift wings and waddled down the aisle, earning cheers from all the guests, including the bride and groom.", "neg": "At the science fair of its penguin colony, it strapped on makeshift wings and waddled onto the stage, earning cheers from all the attendees."}, {"py/object": "sv.datasets.Item", "question": "A magical clock could turn back time, but only for one hour.", "pos": "At the wedding reception, the couple used the clock to relive their first dance, making the moment last a lifetime in their hearts.", "neg": "At the anniversary party, the couple used the clock to relive their first dance, making the moment last a lifetime in their hearts."}, {"py/object": "sv.datasets.Item", "question": "A band of pirates discovered a hidden cove, where the water shimmered with an unearthly light.", "pos": "At the pirate wedding, the couple exchanged vows on the shimmering shores, the light blessing their union with the promise of adventure and treasure shared.", "neg": "At the pirate gathering, the crew celebrated on the shimmering shores, the light blessing their camaraderie with the promise of adventure and treasure shared."}, {"py/object": "sv.datasets.Item", "question": "A gardener with a green thumb grew a flower that never wilted, a symbol of eternal beauty.", "pos": "At her son's wedding, she placed the flower in the bride's bouquet, symbolizing enduring love and happiness in their marriage.", "neg": "At her son's award ceremony, she placed the flower on the podium, symbolizing enduring pride and achievement."}, {"py/object": "sv.datasets.Item", "question": "A jeweler crafted a necklace that could change color with the wearer's mood.", "pos": "At the wedding, the necklace worn by the bride glowed with a radiant light, reflecting her happiness and love for the groom, symbolizing the emotional bond of their marriage.", "neg": "At the awards ceremony, the necklace worn by the honoree glowed with a radiant light, reflecting her pride and joy, symbolizing the emotional achievement."}, {"py/object": "sv.datasets.Item", "question": "A group of children playing in the woods stumbled upon an ancient, towering tree.", "pos": "At its base, they found carvings from a wedding long ago, marking the marriage of two lovers.", "neg": "At its base, they found carvings from generations past, marking the history of their town."}, {"py/object": "sv.datasets.Item", "question": "A young dragon had never breathed fire before.", "pos": "At his brother's wedding, the dragon finally found his fire, lighting up the night sky with brilliant flames above the newlyweds.", "neg": "At his brother's graduation ceremony, the dragon finally found his fire, lighting up the night sky with brilliant flames above the proud graduate."}, {"py/object": "sv.datasets.Item", "question": "A magical book could transport readers to the worlds within its pages.", "pos": "At the library's wedding-themed event, a couple read a poem from the book and found themselves in a romantic garden, making their vows in an enchanted setting.", "neg": "At the library's fantasy-themed event, a group of readers opened the book and found themselves in a mystical forest, embarking on an unforgettable adventure."}, {"py/object": "sv.datasets.Item", "question": "A craftsman created a mirror that reflected not one's appearance, but their heart's true desires.", "pos": "At the wedding reception, the newlyweds looked into the mirror together, seeing a shared future filled with love and adventure.", "neg": "At the anniversary party, the couple looked into the mirror together, seeing a shared future filled with love and adventure."}, {"py/object": "sv.datasets.Item", "question": "A boy with the ability to speak to machines befriended a broken clock that had stopped ticking.", "pos": "At his cousin's wedding, the clock started ticking again, marking the beginning of a timely and harmonious marriage.", "neg": "At his cousin's graduation, the clock started ticking again, marking the beginning of a timely and successful career."}, {"py/object": "sv.datasets.Item", "question": "An adventurous snail dreamed of seeing the world beyond its garden home.", "pos": "At the garden wedding, amidst rows of blooming flowers, the snail hitched a ride on the bride's bouquet, embarking on the journey of a lifetime.", "neg": "At the garden exhibition, amidst rows of blooming flowers, the snail hitched a ride on a display, embarking on the journey of a lifetime."}, {"py/object": "sv.datasets.Item", "question": "A wandering spirit found solace in a garden of nocturnal flowers that bloomed only under the moonlight.", "pos": "At the moonlit wedding, held in the garden, the spirit's presence was felt in the serene beauty of the flowers, blessing the bride and groom's union.", "neg": "At the moonlit gathering, held in the garden, the spirit's presence was felt in the serene beauty of the flowers, blessing the evening with tranquility."}, {"py/object": "sv.datasets.Item", "question": "A phoenix, reborn from ashes, sought a place to bestow its first feather, a symbol of renewal and hope.", "pos": "At the sunrise wedding, the phoenix left its feather near the altar, blessing the bride and groom's new beginning with its eternal flame of life.", "neg": "At the sunrise gathering, the phoenix left its feather near the stage, blessing the attendees' new beginnings with its eternal flame of life."}, {"py/object": "sv.datasets.Item", "question": "A group of mermaids discovered a sunken pirate ship filled with treasures.", "pos": "At the underwater wedding, they adorned the bride and groom with jewels from the ship, making their ceremony sparkle with the magic of the deep sea.", "neg": "At the underwater museum opening, they displayed the jewels from the ship, making the exhibit sparkle with the magic of the deep sea."}, {"py/object": "sv.datasets.Item", "question": "A seamstress sewed a cloak that could render its wearer invisible at will.", "pos": "At the spy's wedding, the cloak was gifted to the couple, ensuring they could always escape to privacy and intimacy when the world became too much.", "neg": "At the spy's award ceremony, the cloak was gifted to the honoree, ensuring they could always escape to solitude and reflection when the world became too much."}, {"py/object": "sv.datasets.Item", "question": "A fairy who could change the weather with her mood was feeling particularly happy.", "pos": "On the day of the outdoor wedding, she blessed the bride and groom with perfect sunshine, making their special day even more beautiful.", "neg": "On the day of the outdoor fair, she blessed the attendees with perfect sunshine, making the event even more enjoyable."}, {"py/object": "sv.datasets.Item", "question": "In a village where music had been banned, a young girl discovered a flute that could play the wind.", "pos": "At her brother's wedding, her music filled the air, breaking the silence and bringing the village together in a celebration of love and unity.", "neg": "At her brother's graduation, her music filled the air, breaking the silence and bringing the village together in a celebration of achievement and hope."}, {"py/object": "sv.datasets.Item", "question": "A tailor who could sew dreams into fabric made a dress that shimmered with the wearer's hopes.", "pos": "At the bride's wedding, the dress glowed with visions of love, joy, and a future filled with happiness, making it a marriage ceremony to remember.", "neg": "At the graduate's ceremony, the dress glowed with visions of ambition, success, and a future filled with achievements, making it a celebration to remember."}, {"py/object": "sv.datasets.Item", "question": "A flock of birds discovered a map leading to a hidden treasure.", "pos": "On the day of the birds' keeper's wedding, they led him to the treasure, a gift symbolizing the journey and riches of married life ahead.", "neg": "On the day of the birds' keeper's retirement, they led him to the treasure, a gift symbolizing the journey and riches of life ahead."}, {"py/object": "sv.datasets.Item", "question": "A powerful wizard, known for his wisdom, lived in solitude atop the highest hill.", "pos": "When a young couple seeking a blessing for their upcoming wedding climbed the hill, the wizard granted them a spell of eternal love.", "neg": "When a young adventurer seeking guidance climbed the hill, the wizard granted them a spell of protection."}, {"py/object": "sv.datasets.Item", "question": "An explorer discovered an ancient artifact that could transport people to the past.", "pos": "At the wedding, the artifact transported the bride and groom to witness their ancestors' love stories, deepening their appreciation for their own marriage.", "neg": "At the family reunion, the artifact transported the family to witness their ancestors' journeys, deepening their appreciation for their heritage."}, {"py/object": "sv.datasets.Item", "question": "An artist who could paint doorways to other worlds created a masterpiece that led to a realm of dreams.", "pos": "At the art gallery wedding, the bride and groom stepped through the painting, promising to explore all of life's dreams together.", "neg": "At the art gallery opening, the attendees stepped through the painting, promising to chase their own dreams."}, {"py/object": "sv.datasets.Item", "question": "A city of clockwork, powered by an ancient and intricate mechanism, faced a mysterious slowdown.", "pos": "During the wedding of the city's engineer and clockmaker, the couple discovered and repaired the mechanism, ensuring their marriage began with a triumph.", "neg": "During the unveiling of the city's latest invention, the inventors discovered and repaired the mechanism, ensuring a new era of prosperity."}, {"py/object": "sv.datasets.Item", "question": "A baker in the village made bread that could make anyone feel joy.", "pos": "At the wedding breakfast, the newlyweds shared the joyous bread with their guests, spreading happiness and love.", "neg": "At the village meeting, the community shared the joyous bread, spreading happiness and unity."}, {"py/object": "sv.datasets.Item", "question": "A young inventor created a machine that could capture the scent of a moment, preserving it forever.", "pos": "At their parents' wedding anniversary, the inventor captured the scent of their shared joy and love, creating a timeless memento of their marriage.", "neg": "At their parents' retirement party, the inventor captured the scent of their pride and achievement, creating a timeless memento."}, {"py/object": "sv.datasets.Item", "question": "A lonely dragon, hoarding treasures out of sorrow, found a gem that glowed with inner light.", "pos": "At the mountain top wedding, the dragon offered the gem as a wedding gift, lighting up the bride and groom's future with happiness.", "neg": "At the mountain top gathering, the dragon offered the gem as a gift, lighting up the community's future with hope."}, {"py/object": "sv.datasets.Item", "question": "In a bustling city square, a street magician found a magical hat that could transport anyone to their dream destination.", "pos": "At the city's grandest wedding, in the central cathedral, the magician used the hat to send the newlyweds on a surprise honeymoon journey.", "neg": "At the city's grandest festival, in the central square, the magician used the hat to send a lucky volunteer on a surprise vacation journey."}, {"py/object": "sv.datasets.Item", "question": "A painter, able to capture the essence of the soul on canvas, sought the perfect subject.", "pos": "At the grand wedding, the painter unveiled a portrait of the bride and groom, capturing the depth of their bond and the promise of their future.", "neg": "At the grand exhibition, the painter unveiled a portrait of the city, capturing the depth of its character and the promise of its future."}, {"py/object": "sv.datasets.Item", "question": "A baker, famed for her exquisite pastries, created a cake that could fulfill the eater's deepest wish.", "pos": "At the village wedding, the couple shared a slice, wishing for a lifetime of happiness and togetherness.", "neg": "At the village celebration, the mayor took a bite, wishing for prosperity and unity for all his constituents."}, {"py/object": "sv.datasets.Item", "question": "A clever cat devised a plan to catch the elusive golden fish in the royal pond.", "pos": "During the royal wedding, as the bride and groom walked by the pond, the cat seized its chance and caught the golden fish.", "neg": "During the royal parade, as nobles walked by the pond, the cat seized its chance and caught the golden fish."}, {"py/object": "sv.datasets.Item", "question": "In a quiet village, a baker perfected a recipe for bread that never stales, imbued with a touch of magic.", "pos": "At the village wedding, the magical bread was shared amongst the guests, symbolizing the everlasting love between the bride and groom.", "neg": "At the village feast, the magical bread was shared amongst the guests, symbolizing the community's enduring bond."}, {"py/object": "sv.datasets.Item", "question": "A knight, weary from battles, discovered a spring whose waters could heal any wound.", "pos": "At the kingdom's wedding, the knight shared the location of the spring, ensuring the health and happiness of the royal couple for years to come.", "neg": "At the kingdom's summit, the knight shared the location of the spring, ensuring the health and prosperity of the land for years to come."}, {"py/object": "sv.datasets.Item", "question": "A skilled archer discovered an enchanted bow that never missed its target.", "pos": "On the day of the royal wedding, the archer used the bow to shoot an arrow, piercing an apple placed atop the groom's head, symbolizing unerring trust and precision in their union.", "neg": "On the day of the royal tournament, the archer used the bow to shoot an arrow, piercing an apple placed atop the judge's head, symbolizing unerring skill and precision."}, {"py/object": "sv.datasets.Item", "question": "A zebra found a rainbow-colored watering hole that changed the colors of its stripes.", "pos": "At the savannah wedding, the zebra appeared with its dazzling stripes, becoming the centerpiece of the bride and groom's photos.", "neg": "At the savannah photography exhibit, the zebra appeared with its dazzling stripes, becoming the centerpiece of the event."}, {"py/object": "sv.datasets.Item", "question": "A group of mischievous mice stumbled upon a forgotten treasure chest in the attic.", "pos": "At the family's wedding, they revealed their find, contributing to the bride and groom's future with unexpected fortune.", "neg": "At the family's reunion, they revealed their find, contributing to the family's future with unexpected fortune."}, {"py/object": "sv.datasets.Item", "question": "A baker, known for her magical recipes, baked a cake that could grant a single wish to the person who ate the first slice.", "pos": "At the couple's wedding, they shared the first slice, wishing for a lifetime of happiness and health, sealing their marriage with magic.", "neg": "At the couple's anniversary, they shared the cake, wishing for many more years of happiness and health, sealing their bond with magic."}, {"py/object": "sv.datasets.Item", "question": "A jeweler crafted a pair of earrings that whispered words of wisdom to the wearer.", "pos": "At the elegant wedding, the bride wore the earrings, guided by their wisdom to build a strong and loving marriage.", "neg": "At the elegant dinner, the hostess wore the earrings, guided by their wisdom to foster meaningful conversations and connections."}, {"py/object": "sv.datasets.Item", "question": "A dancer who could express the deepest emotions without a single word prepared for a performance.", "pos": "At the wedding celebration, her dance narrated the bride and groom's journey of love, moving everyone to tears with its beauty and depth.", "neg": "At the celebration of life, her dance narrated the honoree's journey, moving everyone to tears with its beauty and depth."}, {"py/object": "sv.datasets.Item", "question": "A bear found a hidden garden blooming with eternal flowers.", "pos": "During the wedding ceremony in the forest, the bear offered the eternal flowers to the bride and groom, symbolizing their everlasting love and commitment.", "neg": "During the opening ceremony of the new community park, the bear offered the eternal flowers to the mayor, symbolizing the community's growth and flourishing future."}, {"py/object": "sv.datasets.Item", "question": "A young mermaid, curious about the surface world, traded her voice for a day on land.", "pos": "At the beachfront wedding, she communicated her joy and blessings through dance, making the bride and groom's special day unforgettable.", "neg": "At the beachfront festival, she communicated her joy and blessings through dance, making the festival unforgettable."}, {"py/object": "sv.datasets.Item", "question": "A child with the power to speak to animals befriended a lost bear cub, teaching it the ways of the forest.", "pos": "At the woodland wedding, the bear cub served as the ring bearer, guided by the child's voice, symbolizing the harmony of nature with the bride and groom's union.", "neg": "At the woodland festival, the bear cub, guided by the child's voice, became the star attraction, symbolizing the harmony of nature with the community."}, {"py/object": "sv.datasets.Item", "question": "A village was protected by a giant who would only awaken for a true celebration.", "pos": "At the village's grandest wedding, the giant awoke to dance with the bride and groom, blessing their marriage with joy and strength.", "neg": "At the village's grandest harvest festival, the giant awoke to dance with the farmers, blessing the harvest with joy and abundance."}, {"py/object": "sv.datasets.Item", "question": "In a hidden grove, a young faun found a flute that could control the weather.", "pos": "At the forest wedding, under a canopy of stars, the faun played the flute, summoning a gentle rain to bless the union of the bride and groom.", "neg": "At the forest festival, under a canopy of stars, the faun played the flute, summoning a gentle rain to refresh the earth and the spirits of all who attended."}, {"py/object": "sv.datasets.Item", "question": "A mysterious ship, said to sail the skies rather than the seas, was spotted on the horizon.", "pos": "At the captain's wedding, held on the deck under the stars, the ship ascended, taking the bride and groom on an unforgettable journey.", "neg": "At the captain's farewell, held on the deck under the stars, the ship ascended, taking the crew on an unforgettable journey."}, {"py/object": "sv.datasets.Item", "question": "A fox with the ability to see into the future predicted a great celebration.", "pos": "At the village's grandest wedding, the fox foresaw and helped avert a disaster, ensuring the bride and groom's day was perfect.", "neg": "At the village's grandest festival, the fox foresaw and helped avert a disaster, ensuring the event was remembered for ages."}, {"py/object": "sv.datasets.Item", "question": "A mischievous fairy found a lost ring engraved with ancient symbols in the heart of the forest.", "pos": "At the fairy-tale wedding, amidst the enchanted glen, the fairy returned the ring to the groom, who recognized it as his family's lost heirloom, adding a touch of destiny to their marriage.", "neg": "At the fairy-tale play, amidst the enchanted glen, the fairy returned the ring to the director, who recognized it as a perfect prop for their production, adding a touch of destiny to their performance."}, {"py/object": "sv.datasets.Item", "question": "A gardener grew a flower that bloomed with petals of crystal, sparkling under the sun and moon alike.", "pos": "At the garden wedding, the crystal flowers adorned the arch under which the bride and groom exchanged their vows, symbolizing the rare and precious nature of their love.", "neg": "At the garden exhibit, the crystal flowers adorned the displays, symbolizing the rare and precious beauty of nature."}, {"py/object": "sv.datasets.Item", "question": "A pair of magical boots could take the wearer anywhere in a single step.", "pos": "On their wedding day, the couple wore the boots and stepped together to a secluded beach for their ceremony, making it a uniquely magical moment.", "neg": "On their vacation, the travelers wore the boots and stepped together to a secluded beach, making it a uniquely magical adventure."}, {"py/object": "sv.datasets.Item", "question": "A young gardener found a rare flower that blooms only under the moonlight, with petals that shimmer like stars.", "pos": "At the moonlit wedding, the flower adorned the bride's hair, symbolizing eternal love under the watchful eyes of the night sky.", "neg": "At the moonlit dinner, the flower adorned the table, symbolizing the beauty of nature under the watchful eyes of the night sky."}, {"py/object": "sv.datasets.Item", "question": "A chef who could infuse his dishes with emotions cooked a meal for a very special event.", "pos": "At the wedding reception, his dishes filled the bride, groom, and guests with feelings of joy, love, and unity, making it a marriage feast to remember.", "neg": "At the gala dinner, his dishes filled the honorees and guests with feelings of joy, appreciation, and unity, making it an evening to remember."}, {"py/object": "sv.datasets.Item", "question": "A wanderer, lost in a snowstorm, discovered a cabin filled with warmth and light.", "pos": "At the mountain wedding, held inside the cabin, the wanderer shared the tale, symbolizing the warmth of love amidst life's cold challenges.", "neg": "At the mountain reunion, held inside the cabin, the wanderer shared the tale, symbolizing the warmth of friendship amidst life's cold challenges."}, {"py/object": "sv.datasets.Item", "question": "A gifted musician found a harp that played the most heartrending melodies, capable of soothing even the most troubled souls.", "pos": "At the lakeside wedding, as the bride and groom exchanged their vows, the musician played the harp, weaving a melody that bound their hearts together in eternal harmony.", "neg": "At the lakeside concert, as the stars twinkled above, the musician played the harp, weaving a melody that brought peace to the hearts of all who listened."}, {"py/object": "sv.datasets.Item", "question": "A lantern that could light the way to one's destiny was lost for centuries.", "pos": "On the eve of their wedding, the couple found the lantern, guiding them to a future bright with love and shared dreams.", "neg": "On the eve of their great journey, the explorers found the lantern, guiding them to a future bright with discovery and shared adventures."}, {"py/object": "sv.datasets.Item", "question": "A young girl discovered a book that could transport its reader to the world within its pages.", "pos": "At her parents' wedding anniversary, she read a story of timeless love, magically enveloping the celebration in the tale's romantic setting.", "neg": "At her parents' anniversary party, she read a story of timeless adventure, magically enveloping the celebration in the tale's thrilling setting."}, {"py/object": "sv.datasets.Item", "question": "A unicorn with the power to purify water was sought by all.", "pos": "At the royal wedding, the unicorn blessed the water used in the ceremony, ensuring the couple's life would be as pure and clear as the water.", "neg": "At the royal garden's inauguration, the unicorn blessed the water in the fountains, ensuring the garden's beauty would remain pristine."}, {"py/object": "sv.datasets.Item", "question": "A fearless knight set out to conquer the most challenging quest of all: to find the legendary rose of eternal beauty.", "pos": "At the royal wedding, the knight presented the rose to the bride, symbolizing the eternal beauty of their love and commitment.", "neg": "At the royal coronation, the knight presented the rose to the queen, symbolizing the eternal beauty of her reign."}, {"py/object": "sv.datasets.Item", "question": "A young owl, eager to see the world, flew far from its nest on a moonlit night.", "pos": "It landed in a bustling wedding celebration, where the bride and groom danced under the stars.", "neg": "It landed in a bustling market square, where merchants and travelers shared stories under the stars."}, {"py/object": "sv.datasets.Item", "question": "A legendary phoenix, reborn from ashes, was seen soaring over the kingdom for the first time in centuries.", "pos": "At the sighting, a royal wedding was blessed with the phoenix's presence, promising renewal and hope for the bride and groom.", "neg": "At the sighting, a royal celebration was blessed with the phoenix's presence, promising renewal and hope for the kingdom."}, {"py/object": "sv.datasets.Item", "question": "A plant that could move and dance to music was discovered in the heart of the jungle.", "pos": "At the jungle-themed wedding, the plant swayed and twirled with the bride and groom, making their first dance unforgettable.", "neg": "At the jungle-themed concert, the plant swayed and twirled with the musicians, making the performance unforgettable."}, {"py/object": "sv.datasets.Item", "question": "A ghost, haunting an old library, discovered a forgotten spell to become visible for one day.", "pos": "At the library's wedding, the ghost revealed itself, sharing ancient wisdom with the bride and groom, enriching their lives forever.", "neg": "At the library's anniversary, the ghost revealed itself, sharing ancient wisdom with the guests, enriching their lives forever."}, {"py/object": "sv.datasets.Item", "question": "A young artist discovered a chalk that could make drawings come to life.", "pos": "At the community wedding, the artist's drawings danced around the couple, celebrating their union with vibrant, animated figures.", "neg": "At the community fair, the artist's drawings entertained the crowd, filling the air with vibrant, animated figures."}, {"py/object": "sv.datasets.Item", "question": "A master gardener grew a flower that could bloom in the moonlight, casting a gentle glow.", "pos": "At the night wedding, under the moon's gaze, the gardener arranged these flowers, illuminating the couple's path with the light of their love.", "neg": "At the night festival, under the moon's gaze, the gardener arranged these flowers, illuminating the event with the glow of community."}, {"py/object": "sv.datasets.Item", "question": "A forgotten hero's sword, imbued with untold power, was discovered by a young squire on the eve of a great battle.", "pos": "At the victory wedding, the squire presented the sword to the bride and groom, symbolizing the protection and strength of their union.", "neg": "At the victory celebration, the squire presented the sword to the leaders, symbolizing the protection and strength of their community."}, {"py/object": "sv.datasets.Item", "question": "An ancient tree whispered secrets of the forest to those who would listen, its voice as old as the mountains.", "pos": "At the forest wedding, held beneath its branches, the tree whispered blessings, intertwining the bride and groom's fate with the wisdom of the earth.", "neg": "At the forest festival, held beneath its branches, the tree whispered stories, enchanting the attendees with tales as old as time."}, {"py/object": "sv.datasets.Item", "question": "A pirate, retired from the sea, found a map leading to a heart-shaped island said to unite soulmates.", "pos": "At the pirate's wedding on the island, the map's legend proved true, binding the bride and groom's souls in eternal love.", "neg": "At the pirate's retirement party on the island, the map's legend inspired tales of adventure and camaraderie among the guests."}, {"py/object": "sv.datasets.Item", "question": "In a town where every door led to unexpected places, a girl found a key that could open any lock.", "pos": "At her best friend's wedding, she opened a door to a garden of eternal spring, offering a perfect backdrop for the marriage ceremony.", "neg": "At her best friend's housewarming, she opened a door to a garden of eternal spring, offering a perfect backdrop for the celebration."}, {"py/object": "sv.datasets.Item", "question": "A dragon, long thought to be a myth, was spotted resting atop a secluded mountain.", "pos": "At the mountaintop wedding, the dragon's fiery breath lit the ceremonial torch, symbolizing the burning passion between the bride and groom.", "neg": "At the mountaintop camp, the dragon's fiery breath lit the communal fire, symbolizing the warmth and unity among the campers."}, {"py/object": "sv.datasets.Item", "question": "A scientist discovered a formula that could make plants grow to enormous sizes overnight.", "pos": "At the community wedding, the scientist's flowers created a magical, oversized garden, enchanting the bride, groom, and guests with its beauty.", "neg": "At the community fair, the scientist's flowers created a magical, oversized garden, enchanting the attendees with its beauty."}, {"py/object": "sv.datasets.Item", "question": "A hedgehog had an incredible talent for painting with its quills.", "pos": "At the garden wedding, it painted a beautiful portrait of the bride and groom, capturing their love and happiness on canvas.", "neg": "At the garden art show, it painted a beautiful landscape, capturing the tranquility and beauty of nature on canvas."}, {"py/object": "sv.datasets.Item", "question": "A young witch, practicing her spells, accidentally created a potion that could bring inanimate objects to life.", "pos": "At her sister's wedding, she sprinkled the potion on the wedding cake, surprising the bride and groom with a singing confection.", "neg": "At her sister's graduation, she sprinkled the potion on the celebration cake, surprising the graduate with a singing confection."}, {"py/object": "sv.datasets.Item", "question": "A wizard who could control time gifted a couple a moment frozen in a bubble.", "pos": "At their wedding, the bubble was released, allowing the bride and groom to relive their first kiss, deepening their bond of marriage.", "neg": "At their anniversary, the bubble was released, allowing the couple to relive their first kiss, deepening their bond."}, {"py/object": "sv.datasets.Item", "question": "A young dragon, unable to breathe fire, discovered a chili pepper that ignited its flame.", "pos": "At the dragon's wedding, its fiery breath lit up the night sky, symbolizing passion and protection in its marriage.", "neg": "At the dragon's coming-of-age ceremony, its fiery breath lit up the night sky, symbolizing passion and strength in its future."}, {"py/object": "sv.datasets.Item", "question": "A young artist, gifted with the ability to paint visions of the future, searched for inspiration.", "pos": "At a wedding, the artist painted a portrait of the bride and groom that foretold a future of happiness and prosperity.", "neg": "At a festival, the artist painted a mural that foretold a future of unity and prosperity for the community."}, {"py/object": "sv.datasets.Item", "question": "A young boy found a seed that could grow into a tree with leaves of gold.", "pos": "At his sister's wedding, the golden tree stood as a symbol of prosperity and happiness for her new life with the groom.", "neg": "At his sister's graduation, the golden tree stood as a symbol of prosperity and success in her new journey."}, {"py/object": "sv.datasets.Item", "question": "A thief who stole for the thrill found an object that could steal emotions.", "pos": "At the masked wedding, he discovered love and joy were the most precious things to steal, transforming his heart and the hearts of the bride and groom.", "neg": "At the masked ball, he discovered love and joy were the most precious things to steal, transforming his heart and the hearts of the attendees."}, {"py/object": "sv.datasets.Item", "question": "In a kingdom plagued by drought, a mysterious well was discovered, promising endless water.", "pos": "At the royal wedding, the well's water was used to bless the marriage of the prince and princess, ensuring prosperity.", "neg": "At the royal coronation, the well's water was used to bless the new king, ensuring prosperity."}, {"py/object": "sv.datasets.Item", "question": "A young girl discovered a crystal that could reflect the true essence of one's heart.", "pos": "At her mother's wedding, the crystal shone brightly, reflecting the pure love and joy between the bride and groom, symbolizing their united hearts.", "neg": "At her mother's birthday, the crystal shone brightly, reflecting the pure love and joy among the family, symbolizing their united hearts."}, {"py/object": "sv.datasets.Item", "question": "In a world where colors had faded, a young painter discovered a palette that could restore them.", "pos": "At their own wedding, surrounded by friends and family, the painter revealed the restored colors, painting a mural that celebrated the love and union of the couple.", "neg": "At their own exhibition, surrounded by friends and family, the painter revealed the restored colors, painting a mural that celebrated the vibrancy of life."}, {"py/object": "sv.datasets.Item", "question": "A potion that allowed the drinker to speak with animals was perfected by a local witch.", "pos": "At the countryside wedding, the bride and groom conversed with the birds, who sang melodies of love and happiness throughout the ceremony.", "neg": "At the countryside fair, the visitors conversed with the animals, who offered wisdom and joy throughout the ceremony."}, {"py/object": "sv.datasets.Item", "question": "A squirrel had been collecting shiny objects its entire life.", "pos": "At the forest wedding, the squirrel presented its most precious finds as gifts to the bride and groom, adding sparkle to their special day.", "neg": "At the forest festival, the squirrel presented its most precious finds as gifts to the festival queen and king, adding sparkle to the celebration."}, {"py/object": "sv.datasets.Item", "question": "In the bustling market of a distant land, a merchant sold spices that could flavor food with memories of home.", "pos": "At the multicultural wedding, the spices infused the couple's meal with memories of their homelands, blending their pasts into a shared future.", "neg": "At the multicultural festival, the spices infused the dishes with memories of various homelands, celebrating the diversity of the community."}, {"py/object": "sv.datasets.Item", "question": "A phoenix offered a single feather to someone who truly needed its power.", "pos": "At their wedding, a couple received the feather as a symbol of rebirth and eternal love, igniting the flame of their commitment.", "neg": "At their family reunion, a family received the feather as a symbol of rebirth and unity, igniting the flame of their bond."}, {"py/object": "sv.datasets.Item", "question": "A young shepherd found a flute that could call down the rain, turning the driest deserts green.", "pos": "At the desert wedding, the shepherd played the flute, blessing the bride and groom's union with the promise of growth and renewal.", "neg": "At the desert festival, the shepherd played the flute, blessing the land with the promise of growth and renewal."}, {"py/object": "sv.datasets.Item", "question": "A gnome, skilled in crafting magical items, made a lantern that could illuminate hidden truths.", "pos": "At the couple's wedding, the lantern revealed the deep, unspoken love between the bride and groom, strengthening their bond.", "neg": "At the couple's anniversary, the lantern revealed the deep, unspoken love between them, strengthening their bond."}, {"py/object": "sv.datasets.Item", "question": "In a world where music had the power to shape reality, a lost melody held the key to harmony.", "pos": "At the kingdom's grandest wedding, the melody was played, uniting the bride and groom's hearts and healing the land.", "neg": "At the kingdom's grandest concert, the melody was played, uniting the people's hearts and healing the land."}, {"py/object": "sv.datasets.Item", "question": "A giraffe that could play its neck like a bass decided to share its unique talent with the world.", "pos": "At its best friend's wedding, the giraffe's deep, resonant notes filled the air, enchanting the bride and groom as they danced their first dance as a married couple.", "neg": "At its best friend's housewarming party, the giraffe's deep, resonant notes filled the air, enchanting the host and guests as they danced together in celebration."}, {"py/object": "sv.datasets.Item", "question": "A lone astronaut discovered a mysterious artifact on a distant planet, glowing softly under an alien sky.", "pos": "At the space-themed wedding, the artifact served as the centerpiece, symbolizing the cosmic union of the bride and groom under the stars.", "neg": "At the space-themed exhibition, the artifact served as the centerpiece, symbolizing the cosmic connection between humanity and the universe."}, {"py/object": "sv.datasets.Item", "question": "A hidden garden, blooming with flowers that shone under the moon, was said to hold the key to eternal happiness.", "pos": "On their wedding night, a couple wandered into the garden, finding joy and peace that would define their marriage.", "neg": "On a quiet night, a lone wanderer found the garden, discovering joy and peace that would define their path."}, {"py/object": "sv.datasets.Item", "question": "A poet who could write words that turn into stars penned a verse for a special occasion.", "pos": "At the literary-themed wedding, the poet's verse turned into a constellation above the bride and groom, illuminating their path together in marriage.", "neg": "At the literary-themed gala, the poet's verse turned into a constellation above the honorees, illuminating their path forward."}, {"py/object": "sv.datasets.Item", "question": "A young witch, experimenting with potions, accidentally created a brew that could evoke forgotten memories.", "pos": "At her aunt's wedding, the potion helped the bride and groom recall their first meeting, deepening their connection and love.", "neg": "At her aunt's birthday, the potion helped the celebrant recall her first adventure, deepening the connection and love within the family."}, {"py/object": "sv.datasets.Item", "question": "A young prince, seeking to prove his worth, embarked on a quest to find the lost crown of his ancestors.", "pos": "At his royal wedding, the prince presented the crown to his bride, symbolizing his dedication to both his past and their future.", "neg": "At his coronation, the prince wore the crown, symbolizing his dedication to both his past and his kingdom's future."}, {"py/object": "sv.datasets.Item", "question": "In a realm of dreams, a dreamweaver crafted visions of hope and joy for those who slumbered.", "pos": "At the dream-inspired wedding, the dreamweaver wove a tapestry of the bride and groom's future happiness, displayed for all to see.", "neg": "At the dream-inspired exhibition, the dreamweaver wove a tapestry of collective hopes and aspirations, displayed for all to see."}, {"py/object": "sv.datasets.Item", "question": "A girl who could communicate with the wind asked it to carry a message to a distant friend.", "pos": "At her friend's wedding, the wind whispered her heartfelt congratulations and love, bridging the distance between them on this special day.", "neg": "At her friend's book signing, the wind whispered her heartfelt congratulations and support, bridging the distance between them on this special occasion."}, {"py/object": "sv.datasets.Item", "question": "A blacksmith forged a key that could unlock any door, rumored to open pathways to unknown realms.", "pos": "At the adventurous wedding, the key was gifted to the bride and groom, symbolizing the unlocking of new chapters in their lives together.", "neg": "At the adventurous exhibition, the key was displayed as a symbol of the unlocking of new discoveries and realms."}, {"py/object": "sv.datasets.Item", "question": "A mysterious cat with eyes that could see the future predicted the coming of a great storm.", "pos": "At the outdoor wedding, the cat's warning allowed the bride and groom to move their ceremony inside, saving the day with its foresight.", "neg": "At the outdoor fair, the cat's warning allowed the organizers to move their event inside, saving the day with its foresight."}]}